# Exercise 4: Continuing Verification of Data Integrity

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('../Data/default_of_credit_card_clients__courseware_version_1_21_19.xls')

In [3]:
id_counts = df['ID'].value_counts()
id_counts.head()

26d4a6eb-8abe    2
d2a47fa6-0f6a    2
4653bc48-0141    2
f56a0841-4328    2
0170086d-7472    2
Name: ID, dtype: int64

In [4]:
dupe_mask = id_counts == 2

In [5]:
dupe_mask[0:5]

26d4a6eb-8abe    True
d2a47fa6-0f6a    True
4653bc48-0141    True
f56a0841-4328    True
0170086d-7472    True
Name: ID, dtype: bool

In [6]:
id_counts.index[0:5]

Index(['26d4a6eb-8abe', 'd2a47fa6-0f6a', '4653bc48-0141', 'f56a0841-4328',
       '0170086d-7472'],
      dtype='object')

In [7]:
dupe_ids = id_counts.index[dupe_mask]

In [8]:
dupe_ids = list(dupe_ids)
len(dupe_ids)

313

In [9]:
dupe_ids[0:5]

['26d4a6eb-8abe',
 'd2a47fa6-0f6a',
 '4653bc48-0141',
 'f56a0841-4328',
 '0170086d-7472']

In [10]:
df.loc[df['ID'].isin(dupe_ids[0:3]),:]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
2597,d2a47fa6-0f6a,90000,2,2,2,24,0,0,0,0,...,5152,4664,4833,1240,1220,1000,500,800,1680,0
2678,4653bc48-0141,200000,2,2,2,43,0,0,0,0,...,190775,196449,192085,8155,8302,7225,10153,6987,5262,0
2697,d2a47fa6-0f6a,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2778,4653bc48-0141,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
25004,26d4a6eb-8abe,50000,1,3,1,49,0,0,0,0,...,48995,19780,15102,2000,5000,2305,3000,559,3000,0
25104,26d4a6eb-8abe,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

We can see some duplicates here, and it looks like every duplicate ID has one row with data, and another row with all zeros. Is this the case for every duplicate ID? Let's check.

In [11]:
df.shape

(30000, 25)

In [12]:
df_zero_mask = df == 0

In [13]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis=1)

In [14]:
sum(feature_zero_mask)

315

It looks like there are at least as many "zero rows" as there are duplicate IDs. Let's remove all the rows with all zero features and response, and see if that gets rid of the duplicate IDs.

In [15]:
df_clean_1 = df.loc[~feature_zero_mask,:].copy()

In [16]:
df_clean_1.shape

(29685, 25)

In [17]:
df_clean_1['ID'].nunique()

29685

Looks like this worked. Save progress for next exercise.

In [18]:
df_clean_1.to_csv('../Data/df_clean_1.csv', index=False)